webservice/src/main/java/com/walterwhites/library/webservice/test/request_book.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://walterwhites.io/webservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getBookRequest>
            <gs:name>Spain</gs:name>
        </gs:getBookRequest>
    </soapenv:Body>
</soapenv:Envelope>